Tekla Open API Reference for Tekla Structures 2025
IntegerConverter.CanConvertTo Method
 Checks whether the conversion can be made from the integer datatype to the destination type.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool CanConvertTo(
	ITypeDescriptorContext context,
	Type destinationType
)
Public Overrides Function CanConvertTo (
	context As ITypeDescriptorContext,
	destinationType As Type
) As Boolean
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
The context.
destinationType
Type: System.Type
The type to convert to.
Return Value
Type: Boolean
True if possible, false if not possible.
See Also
Reference
IntegerConverter Class
Tekla.Structures.Datatype Namespace